In [5]:
import pandas as pd
import numpy as np



data_df_0=pd.read_csv("daily_sales_data_0.csv")
data_df_1=pd.read_csv("daily_sales_data_1.csv")
data_df_2=pd.read_csv("daily_sales_data_2.csv")

In [2]:
data_df_0.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [3]:
data_df_1.head()

       product  price  quantity        date region
0  pink morsel  $3.00       545  2019-06-11  north
1  pink morsel  $3.00       521  2019-06-11  south
2  pink morsel  $3.00       595  2019-06-11   east
3  pink morsel  $3.00       507  2019-06-11   west
4  gold morsel  $9.99       529  2019-06-11  north

In [4]:
data_df_2.head()

       product  price  quantity        date region
0  pink morsel  $3.00       526  2020-10-13  north
1  pink morsel  $3.00       546  2020-10-13  south
2  pink morsel  $3.00       505  2020-10-13   east
3  pink morsel  $3.00       561  2020-10-13   west
4  gold morsel  $9.99       553  2020-10-13  north

In [6]:
data_df_0.describe()

           quantity
count  13720.000000
mean     549.857945
std       28.999290
min      500.000000
25%      525.000000
50%      550.000000
75%      575.000000
max      600.000000

In [10]:
data_df_0.isnull().sum()

product     0
price       0
quantity    0
date        0
region      0
dtype: int64

In [8]:
data_df_1.isnull().sum()

product     0
price       0
quantity    0
date        0
region      0
dtype: int64

In [9]:
data_df_2.isnull().sum()

product     0
price       0
quantity    0
date        0
region      0
dtype: int64

In [18]:
# concatenate the three dataframes vertically into a single dataframe
Combined_Sales_df = pd.concat([data_df_0, data_df_1, data_df_2], ignore_index=True)

In [13]:
Combined_Sales_df.head()

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [21]:
Combined_Sales_df.to_csv("Combined_Sales_df.csv")

In [20]:
# convert price strings like '$3.00' to float 3.00
Combined_Sales_df['price'] = Combined_Sales_df['price'].str.replace(r'[\$,]', '', regex=True).astype(float)

In [19]:
Combined_Sales_df

                product  price  quantity        date region
0           pink morsel  $3.00       546  2018-02-06  north
1           pink morsel  $3.00       549  2018-02-06  south
2           pink morsel  $3.00       577  2018-02-06   east
3           pink morsel  $3.00       519  2018-02-06   west
4           gold morsel  $9.99       580  2018-02-06  north
...                 ...    ...       ...         ...    ...
41155  vermilion morsel  $4.99       475  2022-02-14   west
41156      lapis morsel  $1.99       425  2022-02-14  north
41157      lapis morsel  $1.99       454  2022-02-14  south
41158      lapis morsel  $1.99       483  2022-02-14   east
41159      lapis morsel  $1.99       427  2022-02-14   west

[41160 rows x 5 columns]